## repositories plan
```
module.ministryofjustice.module.operations-engineering-devcontainer.github_repository.default: Refreshing state... [id=operations-engineering-devcontainer]
module.ministryofjustice.module.operations-engineering-dns-form.github_repository.default: Refreshing state... [id=operations-engineering-dns-form]
module.ministryofjustice.module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.ministryofjustice.module.moj-terraform-aws-sso.github_repository.default: Refreshing state... [id=moj-terraform-aws-sso]
module.ministryofjustice.module.operations-engineering-join-github.github_repository.default: Refreshing state... [id=operations-engineering-join-github]
module.ministryofjustice.module.terraform-github-repository.github_repository.default: Refreshing state... [id=terraform-github-repository]
module.ministryofjustice.module.template-documentation-site.github_repository.default: Refreshing state... [id=template-documentation-site]
module.ministryofjustice.module.technical-guidance.github_repository.default: Refreshing state... [id=technical-guidance]
module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default: Refreshing state... [id=operations-engineering-runbooks]
module.ministryofjustice.module.moj-terraform-scim-github.github_repository.default: Refreshing state... [id=moj-terraform-scim-github]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository.default: Refreshing state... [id=operations-engineering-metadata-poc]
module.ministryofjustice.module.operations-engineering-reports.github_repository.default: Refreshing state... [id=operations-engineering-reports]
module.ministryofjustice.module.operations-engineering-example.github_repository.default: Refreshing state... [id=operations-engineering-example]
module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default: Refreshing state... [id=terraform-aws-mtasts]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository.default: Refreshing state... [id=tech-docs-github-pages-publisher]
module.ministryofjustice.module.operations-engineering-dns-issues.github_repository.default: Refreshing state... [id=operations-engineering-dns-issues]
module.ministryofjustice.module.operations-engineering-dns-spike.github_repository.default: Refreshing state... [id=operations-engineering-dns-spike]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default: Refreshing state... [id=operations-engineering-certificate-renewal]
module.ministryofjustice.module.github-collaborators.github_repository.default: Refreshing state... [id=github-collaborators]
module.ministryofjustice.module.tech-docs-monitor.github_repository.default: Refreshing state... [id=tech-docs-monitor]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository.default: Refreshing state... [id=cloud-platform-maintenance-pages]
module.ministryofjustice.module.test_tamf_repo_2.github_repository.default: Refreshing state... [id=test-tamf-repo-2]
module.ministryofjustice.module.template-repository.github_repository.default: Refreshing state... [id=template-repository]
module.ministryofjustice.module.operations-engineering.github_repository.default: Refreshing state... [id=operations-engineering]
module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default: Refreshing state... [id=operations-engineering-user-guide]
module.ministryofjustice.module.terraform-template-poc.github_repository.default: Refreshing state... [id=terraform-template-poc]
module.ministryofjustice.module.github.github_repository.default: Refreshing state... [id=.github]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default: Refreshing state... [id=operations-engineering-support-metadata]
module.ministryofjustice.module.acronyms.github_repository.default: Refreshing state... [id=acronyms]
data.github_team.operations_engineering: Reading...
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.github_repository.default: Refreshing state... [id=operations-engineering-kpi-dashboard-poc]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default: Refreshing state... [id=operations-engineering-documentation-browser-extension]
data.github_team.test_team_access: Reading...
data.github_team.test_team_access: Read complete after 1s [id=9472191]
data.github_team.operations_engineering_test: Reading...
data.github_team.operations_engineering_test: Read complete after 0s [id=9456244]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default: Refreshing state... [id=test-tamf-repo-test-org]
module.ministryofjustice-test.module.test-repo-levg.github_repository.default: Refreshing state... [id=test-repo-levg]
module.ministryofjustice.module.operations-engineering-dns-form.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMDCRNs4DB666]
module.ministryofjustice.module.operations-engineering-dns-form.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-form.github_repository_tag_protection.default: Refreshing state... [id=195963]
module.ministryofjustice.module.operations-engineering-devcontainer.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLCkQts4Cv-3X]
module.ministryofjustice.module.operations-engineering-devcontainer.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-devcontainer.github_repository_tag_protection.default: Refreshing state... [id=164706]
module.ministryofjustice.module.template-documentation-site.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.template-documentation-site.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEQGgTs4CwPiI]
module.ministryofjustice.module.operations-engineering-dns-form.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.ministryofjustice.module.template-documentation-site.github_repository_tag_protection.default: Refreshing state... [id=165193]
module.ministryofjustice.module.operations-engineering-join-github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-join-github.github_repository_tag_protection.default: Refreshing state... [id=165170]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-devcontainer.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGION]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGISTRY]
data.github_team.operations_engineering: Read complete after 7s [id=4192115]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REPOSITORY]
module.ministryofjustice.module.template-documentation-site.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGION]
module.ministryofjustice.module.operations-engineering-join-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC4ns4CwPGB]
module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-join-github.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.terraform-github-repository.github_repository_tag_protection.default: Refreshing state... [id=166200]
module.ministryofjustice.module.terraform-github-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLELUgs4CwzoY]
module.ministryofjustice.module.moj-terraform-aws-sso.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.moj-terraform-aws-sso.github_repository_tag_protection.default: Refreshing state... [id=164896]
module.ministryofjustice.module.moj-terraform-aws-sso.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEYOl7c4CwGtj]
module.ministryofjustice.module.moj-terraform-scim-github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.moj-terraform-scim-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoPJ8s4CwGtf]
module.ministryofjustice.module.moj-terraform-scim-github.github_repository_tag_protection.default: Refreshing state... [id=164897]
module.ministryofjustice.module.github-actions.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.ministryofjustice.module.github-actions.github_repository_tag_protection.default: Refreshing state... [id=164901]
module.ministryofjustice.module.github-actions.github_branch_protection.default: Refreshing state... [id=BPR_kwDODNFKOs4CwGtk]
module.ministryofjustice.module.operations-engineering-dns-issues.github_repository_tag_protection.default: Refreshing state... [id=196802]
module.ministryofjustice.module.moj-terraform-aws-sso.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-dns-issues.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMIbLL84DDdaX]
module.ministryofjustice.module.operations-engineering-dns-issues.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.technical-guidance.github_repository_tag_protection.default: Refreshing state... [id=165189]
module.ministryofjustice.module.moj-terraform-scim-github.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.technical-guidance.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.technical-guidance.github_branch_protection.default: Refreshing state... [id=BPR_kwDOBeUD0s4CwPiB]
module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github-actions.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-runbooks.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKK8OCc4CwPGM]
module.ministryofjustice.module.operations-engineering-runbooks.github_repository_tag_protection.default: Refreshing state... [id=165175]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC3Jc4CwPGL]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-dns-issues.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-metadata-poc:ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository_tag_protection.default: Refreshing state... [id=165174]
module.ministryofjustice.module.technical-guidance.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-reports.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEpRCis4CwPF-]
module.ministryofjustice.module.operations-engineering-reports.github_repository_tag_protection.default: Refreshing state... [id=165169]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REGION]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-reports:ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-example.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REGION]
module.ministryofjustice.module.operations-engineering-reports.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-example.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKnX9OM4CwPGH]
module.ministryofjustice.module.operations-engineering-example.github_repository_tag_protection.default: Refreshing state... [id=165173]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.terraform-aws-mtasts.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHWUugs4CwPiH]
module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-aws-mtasts.github_repository_tag_protection.default: Refreshing state... [id=165192]
module.ministryofjustice.module.operations-engineering-example.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_branch_protection.default: Refreshing state... [id=BPR_kwDOE7RAx84CwPh_]
module.ministryofjustice.module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository_tag_protection.default: Refreshing state... [id=165187]
module.ministryofjustice.module.operations-engineering-dns-spike.github_repository_tag_protection.default: Refreshing state... [id=190393]
module.ministryofjustice.module.operations-engineering-dns-spike.github_branch_protection.default: Refreshing state... [id=BPR_kwDOL4z9984C-v0W]
module.ministryofjustice.module.operations-engineering-dns-spike.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository_tag_protection.default: Refreshing state... [id=165171]
module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_branch_protection.default: Refreshing state... [id=BPR_kwDOI-Hjhc4CwPF_]
module.ministryofjustice.module.github-collaborators.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github-collaborators.github_repository_tag_protection.default: Refreshing state... [id=164898]
module.ministryofjustice.module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.github-collaborators.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoQScc4CwGtd]
module.ministryofjustice.module.tech-docs-monitor.github_repository_tag_protection.default: Refreshing state... [id=165188]
module.ministryofjustice.module.tech-docs-monitor.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.tech-docs-monitor.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHQFa_s4CwPiA]
module.ministryofjustice.module.operations-engineering-dns-spike.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEeVbDs4CwGth]
module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository_tag_protection.default: Refreshing state... [id=164899]
module.ministryofjustice.module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.test_tamf_repo_2.github_repository_tag_protection.default: Refreshing state... [id=170152]
module.ministryofjustice.module.github-collaborators.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.test_tamf_repo_2.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf1s4Cyrgn]
module.ministryofjustice.module.test_tamf_repo_2.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.template-repository.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.template-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDODYkhA84CwPiC]
module.ministryofjustice.module.tech-docs-monitor.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.template-repository.github_repository_tag_protection.default: Refreshing state... [id=165191]
module.ministryofjustice.module.terraform-template-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-template-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOJKjnDs4CwPiD]
module.ministryofjustice.module.terraform-template-poc.github_repository_tag_protection.default: Refreshing state... [id=165190]
module.ministryofjustice.module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository_tag_protection.default: Refreshing state... [id=170153]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf2c4Cyrgo]
module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOFbeyoM4CwGtg]
module.ministryofjustice.module.test_tamf_repo_2.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.github.github_repository_tag_protection.default: Refreshing state... [id=164900]
module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.template-repository.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice-test.module.test-repo-levg.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLPRAVc4CyGYH]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Read complete after 0s [id=3380204578043523366]
module.ministryofjustice-test.module.test-repo-levg.github_repository_tag_protection.default: Refreshing state... [id=168994]
module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering.github_branch_protection.default: Refreshing state... [id=BPR_kwDODVCV0c4CwPYY]
module.ministryofjustice.module.operations-engineering.github_repository_tag_protection.default: Refreshing state... [id=165184]
module.ministryofjustice.module.operations-engineering-user-guide.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKCGhm84CwPGO]
module.ministryofjustice.module.terraform-template-poc.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-user-guide.github_repository_tag_protection.default: Refreshing state... [id=165176]
module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository_tag_protection.default: Refreshing state... [id=172607]
module.ministryofjustice.module.operations-engineering-support-metadata.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLWBtds4Cz8XQ]
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.github_repository_tag_protection.default: Refreshing state... [id=188783]
module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOL1tpxs4C9zwq]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository_tag_protection.default: Refreshing state... [id=165168]
module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_branch_protection.default: Refreshing state... [id=BPR_kwDOK636CM4CwPF8]
module.ministryofjustice.module.acronyms.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.acronyms.github_repository_tag_protection.default: Refreshing state... [id=164902]
module.ministryofjustice.module.acronyms.github_branch_protection.default: Refreshing state... [id=BPR_kwDODR2mI84CwGtl]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"]: Refreshing state... [id=9456244:test-tamf-repo-test-org]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.push["9472191"]: Refreshing state... [id=9472191:test-tamf-repo-test-org]
module.ministryofjustice.module.operations-engineering-dns-spike.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-spike]
module.ministryofjustice.module.terraform-aws-mtasts.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-aws-mtasts]
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:tech-docs-github-pages-publisher]
module.ministryofjustice.module.template-documentation-site.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-documentation-site]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-join-github]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-metadata-poc]
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-kpi-dashboard-poc]
module.ministryofjustice.module.acronyms.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.test_tamf_repo_2.github_team_repository.maintain["4192115"]: Refreshing state... [id=4192115:test-tamf-repo-2]
module.ministryofjustice.module.operations-engineering-dns-issues.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-issues]
module.ministryofjustice.module.terraform-template-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-template-poc]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-certificate-renewal]
module.ministryofjustice.module.tech-docs-monitor.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:tech-docs-monitor]
module.ministryofjustice.module.acronyms.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:acronyms]
module.ministryofjustice.module.operations-engineering-dns-form.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-form]
module.ministryofjustice.module.technical-guidance.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:technical-guidance]
module.ministryofjustice.module.moj-terraform-scim-github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:moj-terraform-scim-github]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering]
module.ministryofjustice.module.operations-engineering-user-guide.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-example.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-example]
module.ministryofjustice.module.operations-engineering-devcontainer.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-devcontainer]
module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-actions]
module.ministryofjustice.module.operations-engineering-support-metadata.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-support-metadata]
module.ministryofjustice.module.moj-terraform-aws-sso.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:moj-terraform-aws-sso]
module.ministryofjustice.module.github-collaborators.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-collaborators]
module.ministryofjustice.module.operations-engineering-reports.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-reports]
module.ministryofjustice.module.github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:.github]
module.ministryofjustice.module.terraform-github-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-github-repository]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:cloud-platform-maintenance-pages]
module.ministryofjustice.module.template-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-repository]
module.ministryofjustice.module.operations-engineering-runbooks.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-runbooks]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ministryofjustice.module.acronyms.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"1e4f1607683daeb85cc9022dd919a61008db576fb5eba6f177c77fc63cbba4d1\"" -> "W/\"6f19f575495db07a627ee3440847609409dabd10e7e07268afc537599a74a93a\""
        id                          = "acronyms"
        name                        = "acronyms"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"dd1af857ae75b98d76b8a106365724dfec51534d29ddec62b13af0493ee7944f\"" -> "W/\"63f64333aa2cd6619da2ac65f7b46e1c89b94662041863b9ec6f5ae45fb9d0c4\""
        id                          = "cloud-platform-maintenance-pages"
        name                        = "cloud-platform-maintenance-pages"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.github.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"0d9183ee859bf43bd59adef7cc8efd3720dd5363fecbdeb6dcb1ae697a5910c4\"" -> "W/\"dde7c6a8e8cca160fb3aea80c3a0cc5d4c5b72673b8c70cde8b5598f8a0844f9\""
        id                          = ".github"
        name                        = ".github"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ministryofjustice.module.github-actions.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"8125bb1c6c45826e791533f1b22641bccb467eb5f4fc491ed7c35044f40db716\"" -> "W/\"98800dd8b9ea883449777b635f6fb64f56345d5c8a1d6fc0d9d0bfb77930ca8a\""
        id                          = "github-actions"
        name                        = "github-actions"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.github-collaborators.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"dc5cc9f6ac20c699e5d244eb58c4ffce7de0a68847a238b7873b6b02fdf7d189\"" -> "W/\"615ed4db3c94c0e2f01857c9bc172527f6ae83b7199e85307c147f5fb418a8df\""
        id                          = "github-collaborators"
        name                        = "github-collaborators"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.moj-terraform-aws-sso.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"fb345d64fe97490217696b06ce6d2761527d43b4dcea37508617514cf0f87973\"" -> "W/\"65e8f75e0486250d2a17e5a60eac4768b4b1cbf9012ab2c17909ddd1a9291b3d\""
        id                          = "moj-terraform-aws-sso"
        name                        = "moj-terraform-aws-sso"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ministryofjustice.module.moj-terraform-scim-github.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"5c6970b08cd3167c4d425299899bbb2cc3f629157bd3f4e9fcfc9abcb982c9a8\"" -> "W/\"1f2deed47e6ec3b3766fba041ed7767a305caf6e430a9964dfdb339bedec3c2e\""
        id                          = "moj-terraform-scim-github"
        name                        = "moj-terraform-scim-github"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"3340c12b9babff28924b2799b9317a5ad06ab9f0567edd70bc62334bedcd9902\"" -> "W/\"53ce82cc8b7315e330dce22345c647d6f4fa1b490b37d6aa47b64c66db722762\""
        id                          = "operations-engineering"
        name                        = "operations-engineering"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"84ce6083e8332c801a90f70820fcc9972a32cfbae5921bd892be3e93d0406240\"" -> "W/\"8ed17ded4ab7234a60f2c45a4e1d91f3a9469d5695d64c4d254016bcde599f71\""
        id                          = "operations-engineering-certificate-renewal"
        name                        = "operations-engineering-certificate-renewal"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-devcontainer.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"8368daae210f956c91fc26df2b9d86b1ac51a3e460dd5cb1d7e776a795822ec7\"" -> "W/\"972a581b7db3ab117997a3b51bd1245f37bda2cd357242439639826558d05c08\""
        id                          = "operations-engineering-devcontainer"
        name                        = "operations-engineering-devcontainer"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-dns-form.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"19e3ea1e3b5d6cf0905c06e0d3813c9b2616000b37ebbdb5922bf1652e0224fd\"" -> "W/\"8e064391ad6a45e58f398c48eb9eacd9abafb6598468f94c98c1f44483e64066\""
        id                          = "operations-engineering-dns-form"
        name                        = "operations-engineering-dns-form"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-dns-spike.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"450bb70edfa944d254481c19cef7d90fc9e7197f5d2435baff59a135c45b2bea\"" -> "W/\"fb480df13b87ea1c1b31e4e21057fb869b5f82ecc09f9993219d9665ee95f11c\""
        id                          = "operations-engineering-dns-spike"
        name                        = "operations-engineering-dns-spike"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"7641f49fe62220a2acf8698a0511d806d5ac2acbb5586d5173ead9b91f746c53\"" -> "W/\"fefccbb0e4e5e57144ced2eb9a3748fe626a360cfa46df0436eb2ecc2bd46d4f\""
        id                          = "operations-engineering-documentation-browser-extension"
        name                        = "operations-engineering-documentation-browser-extension"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-example.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"44251a624d0eb39fde9d70e403de8854761684dd00ae49863ff64ee42018d9f4\"" -> "W/\"5850d6104690607403ba7d0c4a4d7d14c45ae553cd5e018df761218b6a11e1f3\""
        id                          = "operations-engineering-example"
        name                        = "operations-engineering-example"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-join-github.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"550d410a4d5664cfeee8b14911c52f5e3b01f3002ce611158f97f3ef85c74507\"" -> "W/\"e0133c537da146cf7e34e6b1049f02e026545a299b73a5722ff837d941297e0b\""
        id                          = "operations-engineering-join-github"
        name                        = "operations-engineering-join-github"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"3b8d955f0dd96ce123e816ba8dfc309b8a6802b983c20d6dff8bfbb1a3121d70\"" -> "W/\"7fa520eebc2c88e98521c8a208d9284200fddf4e54bd4e67a3c3b7a8c2d22952\""
        id                          = "operations-engineering-kpi-dashboard-poc"
        name                        = "operations-engineering-kpi-dashboard-poc"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"af9575ea442c2d46fb058be0c391abd8775177fee2d5e6ff04bedb74b4067ae7\"" -> "W/\"1fe4ac45de6a294415438022b32e07f7929c724ae2cf221b685e353e8f9a37c9\""
        id                          = "operations-engineering-metadata-poc"
        name                        = "operations-engineering-metadata-poc"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-reports.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"5cc0132477c667f4079b4c6c376f3022464cabf8737575fc7d728685b7208ac5\"" -> "W/\"170e587e71cc523d5fd6f5a9e8d60c4adb29457be05ae64c2f9c4092051320f5\""
        id                          = "operations-engineering-reports"
        name                        = "operations-engineering-reports"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"8ee3669d7be3847c398fb2163c568142541aebcd7aafafd62b10c108341fc49a\"" -> "W/\"4e743e0e2dbe49b19d71a1f67e3b5a87258b7b983cfc14300d36accbe8703223\""
        id                          = "operations-engineering-runbooks"
        name                        = "operations-engineering-runbooks"
        # (36 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"c8c337a52e1e0b1f8b106b2389947d85ff9a69b3456a8001ac100126638b063b\"" -> "W/\"c307310805e6e1eee4fe324fec3f5a5cd48553ba611cb9b2322313954ed4c7d1\""
        id                          = "operations-engineering-support-metadata"
        name                        = "operations-engineering-support-metadata"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"803572fb581a3d7175dcdc56855002a83ff85ace5931a00badebb441b5f7cb4c\"" -> "W/\"2c4bd8802dbbe79090804a3baf1f5ce6078e2d4cd56a1e31b2e17d1f1c06ccc3\""
        id                          = "operations-engineering-user-guide"
        name                        = "operations-engineering-user-guide"
        # (36 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"2d837e06d375badc746921bd6878ae75e31498c9a523beceec173e9b93c36abc\"" -> "W/\"ea7a4eff34260af4cec2d34918fb3cbe4848757ff98967cc7f2bdf548c8d60f9\""
        id                          = "tech-docs-github-pages-publisher"
        name                        = "tech-docs-github-pages-publisher"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.tech-docs-monitor.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"57b74ff3083fbade6f2426ba9b07bd46ac9671fca874491abe1adfae6b31e055\"" -> "W/\"c022075adda0c0e74faeded27653aef04055b92512b28fc96cdae3c372224c38\""
        id                          = "tech-docs-monitor"
        name                        = "tech-docs-monitor"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ministryofjustice.module.technical-guidance.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"e0b1933075a76069a75a11f0dc985bda9cf00a5f8bec817722dbace49238417b\"" -> "W/\"279e5dfe59cc40ea9009947c6e260b230e19cd9893aa4d9d0b166acf5fb7db48\""
        id                          = "technical-guidance"
        name                        = "technical-guidance"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.template-documentation-site.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"4abd5b776b5de361ccaae89139a57ce0b59d4e3d366e4410bdb02853ec865c0c\"" -> "W/\"59e42ae963ce79d356e0aed75c157222cc1b35fe20c756ea6d0deb498eec5c74\""
        id                          = "template-documentation-site"
        name                        = "template-documentation-site"
        # (36 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.template-repository.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"d82d19cec19b1d975b38d890c0720540908f5c1978ddf94ca9216282ec049b86\"" -> "W/\"d2bae65e3dc95c27680f693082c90be5e05ed8bf7f914e69d040d17758be0495\""
        id                          = "template-repository"
        name                        = "template-repository"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"c6f412bd8d804fa7386f039aaecdcb6f4b76da5adcd86934f887fb71313ecd19\"" -> "W/\"206e614af1a5ea60711e356166dcd8013d01884b76333e83716fcd467f130bbb\""
        id                          = "terraform-aws-mtasts"
        name                        = "terraform-aws-mtasts"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ministryofjustice.module.terraform-github-repository.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"58c2d8d31302e6e135d1b2ab9c5d02bc48666ba82ddf2326b327c2a08aaaa124\"" -> "W/\"2828fde19000cd10eea8767e538459980835589343fa65a742445d9da474e142\""
        id                          = "terraform-github-repository"
        name                        = "terraform-github-repository"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.terraform-template-poc.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"6b597172d806409327f7fb9241a5af9f1350018d225f4aaa41e08009c98e3d39\"" -> "W/\"460f0845c359ecd971bb0265393098d5f8deb0dcff40ad486a3ae46548f2b086\""
        id                          = "terraform-template-poc"
        name                        = "terraform-template-poc"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.test_tamf_repo_2.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"381df8d0aafa74036f562aefe322f28287b6dfd6be5be519c2bf1ad60196e6b4\"" -> "W/\"9b527ee1676ae1451b6fc70faf109f117b2e6720ba08aeaf0136e844af66e85f\""
        id                          = "test-tamf-repo-2"
        name                        = "test-tamf-repo-2"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice-test.module.test-repo-levg.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"90a1b1df8d0a5dcbc1ee8fe66e9cf6d02798f3e3c63fab1f3ca6df62aa36c1de\"" -> "W/\"67bd2ef9495c3afb7595fb34fdd9bd285575a3c78cf1e45a6abf8c647235f6c8\""
        id                          = "test-repo-levg"
        name                        = "test-repo-levg"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"7ca39ef9b5f1039f80aebce0250019ddd75f24763de266ad102303f7fa8252b0\"" -> "W/\"4be0ee7c52292e261bfa6d7dea518c82abea2560c80fbf791f2a1c284797ce2b\""
        id                          = "test-tamf-repo-test-org"
        name                        = "test-tamf-repo-test-org"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ministryofjustice.module.operations-engineering-octodns-poc.data.github_actions_public_key.default will be read during apply
  # (config refers to values not yet known)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = (known after apply)
    }

  # module.ministryofjustice.module.operations-engineering-octodns-poc.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.ministryofjustice.module.operations-engineering-octodns-poc.github_repository.default will be created
  + resource "github_repository" "default" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "This repository will be used to prove the concept of managing DNS records using OctoDNS. • This repository is defined and managed in Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "operations-engineering-octodns-poc"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "dns",
          + "operations-engineering",
          + "spike",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "ministryofjustice"
          + repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-octodns-poc.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = (known after apply)
      + tag_protection_id = (known after apply)
    }

  # module.ministryofjustice.module.operations-engineering-octodns-poc.github_team_repository.admin["4192115"] will be created
  + resource "github_team_repository" "admin" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "operations-engineering-octodns-poc"
      + team_id    = "4192115"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```